Revit 2026 API

# BuiltInFailuresElevationFailures Class

---

Failures about Elevation.

SystemObject Autodesk.Revit.DBBuiltInFailuresElevationFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ElevationFailures
```
```vb
Public NotInheritable Class ElevationFailures
```
```cpp
public ref class ElevationFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ElevationFailures = class end
```

The BuiltInFailuresElevationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElevationDetach | An Elevation arrow can't keep its Crop Region extents attached. |
|  | IncompatibleElevationTagFamily | Attempt to change elevation tag families to one with incompatible view directions. |
|  | WarnElevSheet | An elevation symbol references views on more than one sheet. It will show a blank sheet reference. To show the correct references, use a separate elevation symbol for the views on each sheet. |

#### Reference

Autodesk.Revit.DB Namespace